Revit 2027 API
ViewPlan.SetViewRange Method
 Sets the view range.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetViewRange(
	PlanViewRange planViewRange
)
Public Sub SetViewRange (
	planViewRange As PlanViewRange
)
public:
void SetViewRange(
	PlanViewRange^ planViewRange
)
member SetViewRange :
        planViewRange : PlanViewRange -> unit
Parameters
planViewRange PlanViewRange
 The view range.
Exceptions
Exception | Condition
ArgumentException |  Plan view range is not valid.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ViewPlan Class
Autodesk.Revit.DB Namespace